emas/loadtest/emas-performance-report/raw_data/sp4/apache_bench_data/500cus/varnish_ab_test_500_1000.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking qap.everythingscience.co.za (be patient)


Server Software:        Zope/(2.13.15,
Server Hostname:        qap.everythingscience.co.za
Server Port:            80

Document Path:          /portal_css/Sunburst%20Theme/public-cachekey-4fff4ed932d766e26813993d85f43eea.css
Document Length:        31966 bytes

Concurrency Level:      500
Time taken for tests:   2.942 seconds
Complete requests:      1000
Failed requests:        0
Write errors:           0
Total transferred:      32552000 bytes
HTML transferred:       31966000 bytes
Requests per second:    339.95 [#/sec] (mean)
Time per request:       1470.793 [ms] (mean)
Time per request:       2.942 [ms] (mean, across all concurrent requests)
Transfer rate:          10806.77 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        3  135 130.2    199     345
Processing:   162 1023 622.4    891    2925
Waiting:        5  572 525.9    476    2668
Total:        170 1158 625.9   1067    2937

Percentage of the requests served within a certain time (ms)
  50%   1067
  66%   1306
  75%   1515
  80%   1672
  90%   1990
  95%   2658
  98%   2775
  99%   2791
 100%   2937 (longest request)