emas/loadtest/emas-performance-report/raw_data/sp4/apache_bench_data/500cus/varnish_ab_test_500_10000.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking qap.everythingscience.co.za (be patient)


Server Software:        Zope/(2.13.15,
Server Hostname:        qap.everythingscience.co.za
Server Port:            80

Document Path:          /portal_css/Sunburst%20Theme/public-cachekey-4fff4ed932d766e26813993d85f43eea.css
Document Length:        31966 bytes

Concurrency Level:      500
Time taken for tests:   28.196 seconds
Complete requests:      10000
Failed requests:        0
Write errors:           0
Total transferred:      325520000 bytes
HTML transferred:       319660000 bytes
Requests per second:    354.66 [#/sec] (mean)
Time per request:       1409.797 [ms] (mean)
Time per request:       2.820 [ms] (mean, across all concurrent requests)
Transfer rate:          11274.34 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        6  282 412.7    200   15212
Processing:   397 1089 1078.3    657   13319
Waiting:        6  336 521.5    202    5665
Total:        413 1372 1134.9    872   15819

Percentage of the requests served within a certain time (ms)
  50%    872
  66%   1040
  75%   1394
  80%   1797
  90%   2603
  95%   3800
  98%   4940
  99%   5676
 100%  15819 (longest request)